In [2]:
import pandas as pd
import numpy as np

## Create Data

In [3]:
mydata={'col1':[1,2,3,4],
        'col2':[444,555,666,444],
        'col3':['abc','def','ghi','xyz']}

In [4]:
df = pd.DataFrame(data=mydata)

In [5]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Create Custom Function

In [6]:
def times2(x):
    value=x*2
    return value

## Apply Function to DataFrame

In [10]:
df.col2.apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [11]:
df.col3.apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [12]:
df['NewColLen'] = df.col3.apply(len)

In [13]:
df

   col1  col2 col3  NewColLen
0     1   444  abc          3
1     2   555  def          3
2     3   666  ghi          3
3     4   444  xyz          3

#### Lamba Expression

In [14]:
df.col2.apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64